# dataframe

In [1]:
import pandas as pd

In [4]:
empty_df = pd.DataFrame()
print(empty_df)

Empty DataFrame
Columns: []
Index: []

In [5]:
l = ['a','b','c']
print(l)

['a', 'b', 'c']

In [7]:
df1 = pd.DataFrame(l)
print

   0
0  a
1  b
2  c

In [8]:
df1

   0
0  a
1  b
2  c

In [14]:
ls_of_ls = [['a','b','c'],['v','f','r'],['y','i','p']]
df2 = pd.DataFrame(ls_of_ls)

In [15]:
df2

   0  1  2
0  a  b  c
1  v  f  r
2  y  i  p

In [22]:
df2[2][2] #same as 2d matrix

'p'

In [23]:
d = {'ID':[1,2,3,4],'ROLL':[45,65,43,67]}
df3 = pd.DataFrame(d)

In [24]:
df3

   ID  ROLL
0   1    45
1   2    65
2   3    43
3   4    67

In [25]:
df3['ID']

0    1
1    2
2    3
3    4
Name: ID, dtype: int64

In [26]:
df3['ROLL']

0    45
1    65
2    43
3    67
Name: ROLL, dtype: int64

In [29]:
d_series = {'ID':pd.Series([1,2,3,4]),'SN':[111,222,333,444]}
df4 = pd.DataFrame(d_series)
df4

   ID   SN
0   1  111
1   2  222
2   3  333
3   4  444